src/test/resources/__files/paymenthandle/create_payment_handle_card_3ds_response.json

{
  "id": "b5c30668-5724-4499-9b9a-c326c943d31c",
  "accountId": "1009688230",
  "paymentType": "CARD",
  "paymentHandleToken": "SC2INoYvSe2MzQuB",
  "merchantRefNum": "fc5b62df1202e491475d",
  "currencyCode": "USD",
  "txnTime": "2023-01-27T10:14:26Z",
  "billingDetails": {
    "nickName": "Home",
    "street": "TEST",
    "city": "CA",
    "zip": "94404",
    "state": "CA",
    "country": "US"
  },
  "customerIp": "10.195.93.117",
  "status": "PAYABLE",
  "amount": 500,
  "action": "NONE",
  "usage": "SINGLE_USE",
  "timeToLiveSeconds": 299,
  "transactionType": "PAYMENT",
  "executionMode": "SYNCHRONOUS",
  "card": {
    "cardExpiry": {
      "month": "10",
      "year": "2025"
    },
    "holderName": "Dilip",
    "cardType": "VI",
    "cardBin": "400000",
    "lastDigits": "1026",
    "cardCategory": "CREDIT",
    "issuingCountry": "US"
  },
  "authentication": {
    "exemptionIndicator": "LOW_VALUE_EXEMPTION"
  },
  "returnLinks": [
    {
      "method": "GET",
      "rel": "default",
      "href": "https://usgaminggamblig.com/payment/return/"
    },
    {
      "method": "GET",
      "rel": "on_completed",
      "href": "https://usgaminggamblig.com/payment/return/success"
    },
    {
      "method": "GET",
      "rel": "on_failed",
      "href": "https://usgaminggamblig.com/payment/return/failed"
    }
  ],
  "skip3ds": false,
  "threeDs": {
    "merchantUrl": "https://example.com/example",
    "deviceChannel": "BROWSER",
    "requestorChallengePreference": "NO_PREFERENCE",
    "messageCategory": "PAYMENT",
    "transactionIntent": "CHECK_ACCEPTANCE",
    "authenticationPurpose": "PAYMENT_TRANSACTION",
    "orderItemDetails": {
      "preOrderItemAvailabilityDate": "2014-01-26",
      "preOrderPurchaseIndicator": "MERCHANDISE_AVAILABLE",
      "reorderItemsIndicator": "FIRST_TIME_ORDER",
      "shippingIndicator": "SHIP_TO_BILLING_ADDRESS"
    },
    "purchasedGiftCardDetails": {
      "amount": 1234,
      "count": 2,
      "currency": "USD"
    },
    "userAccountDetails": {
      "addCardAttemptsForLastDay": 1,
      "changedDate": "2010-01-26",
      "changedRange": "DURING_TRANSACTION",
      "createdDate": "2010-01-26",
      "createdRange": "NO_ACCOUNT",
      "passwordChangedDate": "2012-01-26",
      "passwordChangedRange": "NO_CHANGE",
      "suspiciousAccountActivity": true,
      "totalPurchasesSixMonthCount": 1,
      "transactionCountForPreviousDay": 1,
      "transactionCountForPreviousYear": 3,
      "shippingDetailsUsage": {
        "cardHolderNameMatch": true,
        "initialUsageDate": "2014-01-26",
        "initialUsageRange": "CURRENT_TRANSACTION"
      },
      "userLogin": {
        "authenticationMethod": "NO_LOGIN",
        "data": "Some up to 2048 bytes undefined data",
        "time": "2014-01-26T10:32:28Z"
      },
      "paymentAccountDetails": {
        "createdRange": "NO_ACCOUNT",
        "createdDate": "2010-01-26"
      }
    }
  }
}